package com.shariful.generalknowledge;

public class QuestionsLibrary {

    private String mQuestions[]={
            "প্রথম ভারতীয় উপগ্রহের নাম কি?",
            "পৃথিবীর ক্ষুদ্রতম দেশের নাম কি?",
            "নিচের কোনটিকে নীল গ্রহ বলা হয়?",
            "ভারতের কোথায় মহাকাশ যান পাঠানোর কেন্দ্রটি অবস্থিত?",
            "নিচের কোন গ্রহটি সূর্যের সবচেয়ে কাছে অবস্থিত?",
            "D.D.T কে আবিষ্কার করেছিলেন?",
            "ভারতের বৃহত্তম সমুদ্রবন্দরের নাম কি?",
            "বনস্পতি তৈরিতে কোন গ্যাস ব্যবহার করা হয়?",
            "নিচের কোন রাজ্যে সরাবতী প্রকল্প অবস্থিত?",
            "অ্যালুমিনিয়াম এর প্রধান আকরিকের নাম কি?",
            "ভারতবর্ষের সবচেয়ে বড় মিষ্টি জলের হ্রদ কোনটি?",
            "1829 সালে কে সতীদাহ প্রথা নিষিদ্ধ করেন?",
            "ক্লোরোফর্মের রাসায়নিক নাম কি?",
            "উদীয়মান সূর্যের দেশ বলা হয় কোন দেশকে?",
            "ভারতের দীর্ঘতম নদীর নাম কি?",
            "DNA এর গঠন কে আবিষ্কার করেন?",
            "মানব হৃৎপিণ্ডে কটি চেম্বার বা প্রকোষ্ঠ থাকে?",
            "মানবদেহের একক বৃহত্তম অঙ্গের বা organ এর নাম কি?",
            "মস্তিষ্কের জ্বর কোন প্রাণীর দ্বারা ছড়িয়ে পড়ে?",
            "ক্রোমোসোম নামটি প্রথম কে দেন?",
            "কৃত্তিম রেশম কিসের থেকে তৈরি হয়?",
            "ভারতের প্রথম রাষ্ট্রপতির নাম কি?",
            "ভারতের প্রথম প্রধানমন্ত্রীর নাম কি?",
            "কে প্রথম মাউন্ট এভারেস্টে পদার্পন করেন?",
            "মানবদেহে কতগুলি ক্রোমোসোম থাকে?",
            "ধানের বৈজ্ঞানিক নাম কি?",
            "আমেরিকার প্রথম রাষ্ট্রপতির নাম কি?",
            "নিম্ন লিখিত কোনটি গ্রিন হাউস গ্যাস?",
            "কোন দেশ প্রথম ফুটবল বিশ্বকাপ জয় করে?",
            "থম চাঁদের মাটিতে পা রাখেন কে?",
            "প্রথম কোন ভারতীয় মহাকাশে যান?",
            "ভারতের প্রথম ভাইসরয়ের নাম কি?",
            "প্রথম কে ভারতে সংবাদ পত্র চালু করেন?",
            "প্রথম কোন ভারতীয় নোবেল পুরস্কার পান?",
            "প্রথম “Miss World” হয়েছিলেন কোন মহিলা?",
            "সুপ্রিম কোর্টের প্রথম মহিলা বিচারপতির নাম কি?",
            "প্রথম ভারতীয় নেভি চিফ কে ছিলেন?",
            "আফগানিস্তানের রাজধানীর নাম কি?",
            "চীনের মুদ্রার নাম কি?",
            "“The Crucible” বইটির লেখক কে?",
            "“অভিনব ভারত”-নামক গুপ্ত বিপ্লবী সভা প্রতিষ্টিত হয়েছিল-",
            "গদর দলের নেতা কে ছিলেন ?",
            "Computer প্রোগ্রামের ত্রুটিকে বলা হয়-",
            "ভারত ও মায়ানমারের মধ্যে কোন পর্বতশ্রেণি অবস্থিত?",
            "কোন গ্রন্থে নীল চাষীদের দুঃখ কষ্টের বিবরণ আছে?",
            "দাস বংশের প্রতিষ্ঠাতা কে?",
            " ”আল হিলাল”-পত্রিকার প্রকাশক কে ছিলেন?",
            "ইবন বতুতা কার রাজত্বকালে ভারতে আসেন?",
            "পৃথিবীর প্রাচীনতম গ্রন্থের নাম কি ?",
            " “বেদ”- শব্দের অর্থ কি?"

    };

    private String mChoice[][]={
            {"কলম্বিয়","ভাস্কর","র্আযভট্ট","রোহিনী"},
            {"উগান্ডা","ভুটান","মালদ্বীপ","ভ্যাটিকান সিটি"},
            {"মঙ্গল","বুধ","নেপচুন","পৃথিবী"},
            {"পুনে"," হুইলার দ্বীপ","শ্রীহরিকোটা","থুম্বা"},
            {"বুধ","শুক্র"," মঙ্গল","শনি"},
            {"মোসলে","রূডল্ফ","কার্ল বেঞ্জ","ডাল্টন"},
            {"কলকাতা","কোচিন","চেন্নাই","মুম্বাই"},
            {"অক্সিজেন","কার্বন ডাই অক্সাইড","হাইড্রোজেন","নাইট্রোজেন"},
            {"ওড়িশা","কেরালা","অন্ধ্রপ্রদেশ","কর্ণাটক"},
            {"হেমাটাইট"," ক্রাওলাইট","বক্সাইট","হেমাটাইট"},
            {"পুলিকট হ্রদ","বিরানাম হ্রদ","চিলকা হ্রদ","কোলেরু হ্রদ"},
            {"লর্ড ক্লাইভ","লর্ড কার্জন","লর্ড উইলিয়াম বেন্টিঙ্ক","লর্ড ডালহৌসি"},
            {"সালফিউরিক অ্যাসিড","সোডিয়াম ক্লোরাইড","সোডিয়াম কার্বনেট","ট্রাইক্লোরোমিথেন"},
            {"রাশিয়া","জাপান"," কোরিয়া","হল্যান্ড"},
            {"যমুনা","কাবেরী","গঙ্গা","ব্রহ্মপুত্র"},
            {"কার্ল ল্যান্ড স্টেইনার"," জর্জ ম্যান্ডেল","ওয়াটসন ও ক্রিক","হরগোবিন্দ খোরানা"},
            {"2 টি","3 টি","4 টি","6 টি"},
            {"ফুসফুস","ত্বক","লিভার","হৃদযন্ত্র"},
            {"মশা"," হাওয়া","জল","মাছি"},
            {" E.G. Balibiani"," Chargaff","W. Waldeyer","Watson and Crick"},
            {"কাঠ","উল","কৃত্তিম ফাইবার","ফ্লোয়েম ফাইবার"},
            {"ডক্টর রাজেন্দ্র প্রসাদ","পন্ডিত জওহরলাল নেহেরু","সর্বপল্লী রাধাকৃষ্ণন","সর্দার বল্লভ ভাই পটেল"},
            {"ডক্টর রাজেন্দ্র প্রসাদ","পন্ডিত জওহরলাল নেহেরু","সর্বপল্লী রাধাকৃষ্ণন","সর্দার বল্লভ ভাই পটেল"},
            {"এডমন্ড হিলারি ও শেরপা তেনজিং নোরগে","রবার্ট পেরু","রবার্ট ওয়ালপোল","বাচেন্দ্রি পাল"},
            {"12 টি","24 টি","36 টি","46 টি"},
            {"Tritium vulgar","Solanum nigrum","Eleusine coracana","Oryza sativa"},
            {"জর্জ ফার্নান্ডেজ","জর্জ ওয়াশিংটন","জর্জ ডব্লিউ বুশ"," রিচার্ড নিক্সন"},
            {"অক্সিজেন","কার্বন ডাই অক্সাইড","ওজন গ্যাস","নাইট্রোজেন গ্যাস"},
            {"ব্রাজিল","পর্তুগাল","স্পেন","উরুগুয়ে"},
            {"মার্ক পোলো","এডমান্ড হিলারি","তেনজিং নোরগে","নীল আর্মস্ট্রং"},
            {"রাকেশ শর্মা","সুনিতা উইলিয়ামস","সুনিতা সেহগাল","কল্পনা চাওলা"},
            {"লর্ড ডালহৌসি","লর্ড ক্যানিং","লর্ড ওয়েলেসলি","ওয়ারেন হেস্টিংস"},
            {"জেমস হিকি","লর্ড এলিনব্র্র","লর্ড লিটন","রাজা রাম মোহন রয়"},
            {"আচার্য জগদীশ চন্দ্র বসু","সি ভি রমন","Mother Teresa","রবীন্দ্র নাথ ঠাকুর"},
            {"সুস্মিতা সেন","রিতা ফারিয়া","দিয়ানা হেইডেন","যুক্তা মুখেই"},
            {"সরোজিনী নাইডু","মিসেস মীরা সাহিব ফাতিমা বিবি","সুজাতা মনোহর","লীলা শেঠ"},
            {"S.মুখার্জী","ভাইস এড্মিরাল R.D কাটারি","জেনারেল মহারাজ রাজেন্দ্র সিংহ","S.P সিনহা"},
            {"করাচী","কাবুল","বাগদাদ","তেহরান"},
            {"টাকা","ইয়েন","ইউয়ান","রিয়েল"},
            {"আর্থার মিলার","এনি ফ্রাঙ্ক","নরমান মাইলের","অনিতা নায়ার"},
            {" ক্ষুদিরাম বোস দ্বারা","ভি ডি সভারকর দ্বারা","প্রফুল্ল চাকী দ্বারা","ভগৎ সিং দ্বারা"},
            {"বিজয় কৃষ্ণ","বি জে তিলক","লালা হরদয়াল","বিপিন পাল"},
            {"স্প্যাম্প","ফোলিস","ভাইরাস","বাগস্"},
            {"লুসাই","তিতলি","নকরেক","অনাইমালাই"},
            {"আনন্দমঠ","নীলদর্পন","নীলদর্শন","76 এর মন্বন্তর-এ"},
            {"আলাউদ্দিন খলজি","মুহাম্মদ বিন তুঘলক","কুতুবুদ্দিন আইবক","উপরের কেউই নন"},
            {"মৌলানা আবুল কালাম আজাদ","মহম্মদ আলি"," সৌকত আলি","ভুপেন্দ্রোনাথ দত্ত"},
            {"আকবর","ইলতুৎমিস","মোঃ বিন তুঘলক"," আলাউদ্দিন খলজি"},
            {"ঋকবেদ","সামবেদ","ইলিয়াড","ওডিসি"},
            {" সত্য","ধর্ম","জ্ঞান","অপরিবর্তনশীল"}



    };
    private String mCorrectAns[]={"র্আযভট্ট","ভ্যাটিকান সিটি","পৃথিবী","শ্রীহরিকোটা","বুধ",
            "মোসলে","মুম্বাই","হাইড্রোজেন","কর্ণাটক","বক্সাইট","কোলেরু হ্রদ","লর্ড উইলিয়াম বেন্টিঙ্ক",
            "ট্রাইক্লোরোমিথেন","জাপান","গঙ্গা","ওয়াটসন ও ক্রিক","4 টি","ত্বক","মশা","Watson and Crick",
            "কৃত্তিম ফাইবার","ডক্টর রাজেন্দ্র প্রসাদ","পন্ডিত জওহরলাল নেহেরু","এডমন্ড হিলারি ও শেরপা তেনজিং নোরগে",
            "46 টি","Oryza sativa","জর্জ ওয়াশিংটন","কার্বন ডাই অক্সাইড","উরুগুয়ে","নীল আর্মস্ট্রং","রাকেশ শর্মা",
            "লর্ড ক্যানিং","েমস হিকি","রবীন্দ্র নাথ ঠাকুর","রিতা ফারিয়া","মিসেস মীরা সাহিব ফাতিমা বিবি","ভাইস এড্মিরাল R.D কাটারি",
            "কাবুল","ইউয়ান","আর্থার মিলার","ভি ডি সভারকর দ্বারা","লালা হরদয়াল","বাগস্","লুসাই",
            "নীলদর্পন","কুতুবুদ্দিন আইবক","মৌলানা আবুল কালাম আজাদ","মোঃ বিন তুঘলক","ঋকবেদ","জ্ঞান"

    };

    public String getQuestion (int a)
    {
        String question=mQuestions[a];
        return question;
    }

    public String getChoice1(int a)
    {
        String choice0=mChoice[a][0];
        return choice0;
    }
    public String getChoice2(int a)
    {
        String choice1=mChoice[a][1];
        return choice1;
    }

    public String getChoice3(int a)
    {
        String choice2=mChoice[a][2];
        return choice2;
    }

    public String getChoice4(int a)
    {
        String choice3=mChoice[a][3];
        return choice3;
    }

    public  String getCorrectAnswer(int a)
    {
        String answer=mCorrectAns[a];
        return answer;
    }




}
